- dplyr 함수
    - filter : 행 추출
    - select : 열 추출
    - arrange : 정렬
    - mutate : 변수 추가
    - summarise : 통계치 산출
    - group_by : 집단별로 나누기
    - left_join : 데이터 합치기(열)
    - bind_rows : 데이터 합치기(행)

# 조건에 맞는 데이터 추출

In [1]:
library(dplyr)

Attaching package: ‘dplyr’


The following objects are masked from ‘package:stats’:

    filter, lag


The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

In [2]:
exam <- read.csv("/content/csv_exam.csv")
head(exam)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58
5 5  2     25   80      65
6 6  2     50   89      98

In [ ]:
# class가 1인 경우만 추출
exam %>% filter(class == 1)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58

In [ ]:
# %>% : 파이프 연산자(pipe operator). 함수들을 연결하는 기능

# class가 1이 아닌 경우만 추출
exam %>% filter(class != 1)

   id class math english science
1   5 2     25   80      65
2   6 2     50   89      98
3   7 2     80   90      45
4   8 2     90   78      25
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  13 4     46   98      65
10 14 4     48   87      12
11 15 4     75   56      78
12 16 4     58   98      65
13 17 5     65   68      98
14 18 5     80   78      90
15 19 5     89   68      87
16 20 5     78   83      58

In [ ]:
# math가 50을 초과한 경우만 추출
exam %>% filter(math > 50)

   id class math english science
1   2 1     60   97      60
2   7 2     80   90      45
3   8 2     90   78      25
4  11 3     65   65      65
5  15 4     75   56      78
6  16 4     58   98      65
7  17 5     65   68      98
8  18 5     80   78      90
9  19 5     89   68      87
10 20 5     78   83      58

In [ ]:
# math가 50미만인 경우만 추출
exam %>% filter(math < 50)

  id class math english science
1  3 1     45   86      78
2  4 1     30   98      58
3  5 2     25   80      65
4  9 3     20   98      15
5 12 3     45   85      32
6 13 4     46   98      65
7 14 4     48   87      12

In [ ]:
# english가 80 이하인 경우만 추출
exam %>% filter(english <= 80)

  id class math english science
1  5 2     25   80      65
2  8 2     90   78      25
3 11 3     65   65      65
4 15 4     75   56      78
5 17 5     65   68      98
6 18 5     80   78      90
7 19 5     89   68      87

In [ ]:
# english가 80 이상인 경우만 추출
exam %>% filter(english >= 80)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   9 3     20   98      15
9  10 3     50   98      45
10 12 3     45   85      32
11 13 4     46   98      65
12 14 4     48   87      12
13 16 4     58   98      65
14 20 5     78   83      58

## 여러 조건을 충족하는 행 추출

In [ ]:
# class가 1이면서 math가 50이상인 경우
exam %>% filter(class == 1 & math >= 50)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60

## 여러 조건 중 하나 이상 충족하는 행 추출

In [ ]:
# math가 90이상이거나 english가 90이상인 경우
exam %>% filter(math >= 90 | english >= 90)

  id class math english science
1  1 1     50   98      50
2  2 1     60   97      60
3  4 1     30   98      58
4  7 2     80   90      45
5  8 2     90   78      25
6  9 3     20   98      15
7 10 3     50   98      45
8 13 4     46   98      65
9 16 4     58   98      65

## 목록에 해당되는 행 추출

In [ ]:
# class가 1, 3, 5에 해당하면 추출
exam %>% filter(class == 1 | class == 3 | class == 5)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  17 5     65   68      98
10 18 5     80   78      90
11 19 5     89   68      87
12 20 5     78   83      58

In [ ]:
# %in% 이용하기
# %in% : 매치 연산자(Matching Operator). 변수의 값이 지정한 조건 목록에 해당되는지 확인하는 기능
exam %>% filter(class %in% c(1, 3, 5))

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  17 5     65   68      98
10 18 5     80   78      90
11 19 5     89   68      87
12 20 5     78   83      58

## 추출한 행으로 데이터 만들기

In [ ]:
# class가 1인 행 추출, class1에 할당
class1 <- exam %>% filter(class == 1)
print(class1)

  id class math english science
1  1     1   50      98      50
2  2     1   60      97      60
3  3     1   45      86      78
4  4     1   30      98      58

In [ ]:
# class가 1인 행의 math 평균 구하기
mean(class1$math)

[1] 46.25

## mpg 데이터 분석 연습

*분석계획* : <br>
1. 자동차 배기량에 따라 고속도로 연비가 다른지 알아보려고 함. displ(배기량)이 4이하인 자동차와 5이상인 자동차 중 어떤 자동차의 hwy(고속도로 연비)까 평균적으로 더 높은지 분석<br>
2. 자동차 제조사 별로 도시 연비가 다른지 알아보려고 함. audi와 toyota 중 어느 manufacturer(제조사)의 cty(도시 연비)가 평균적으로 더 높은지 분석 <br>
3. chevrolet, ford, honda 자동차의 고속도로 연비 평균을 알아보려고 함. 이 회사들의 데이터를 추출한 후 hwy 전체 평균을 분석

In [ ]:
# mpg 데이터 불러오기
mpg <- as.data.frame(ggplot2::mpg)

In [ ]:
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact

In [ ]:
# 1. 자동차 배기량에 따라 고속도로 연비가 다른지 알아보려고 함. displ(배기량)이 4이하인 자동차와 5이상인 자동차 중 어떤 자동차의 hwy(고속도로 연비)까 평균적으로 더 높은지 분석
mpg1 <- mpg %>% filter(displ <= 4)
mpg2 <- mpg %>% filter(displ >= 5)

In [ ]:
# displ 4이하인 hwy 평균
mean(mpg1$hwy)

# displ 5이상 hwy 평균
mean(mpg2$hwy)

[1] 25.96319

[1] 18.07895

In [ ]:
# 2. 자동차 제조사 별로 도시 연비가 다른지 알아보려고 함. audi와 toyota 중 어느 manufacturer(제조사)의 cty(도시 연비)가 평균적으로 더 높은지 분석
mpg_audi <- mpg %>% filter(manufacturer == "audi")
mpg_toyota <- mpg %>% filter(manufacturer == "toyota")

# audi의 평균 cty
mean(mpg_audi$cty)

# toyota의 평균 cty
mean(mpg_toyota$cty)

[1] 17.61111

[1] 18.52941

In [ ]:
# 3. chevrolet, ford, honda 자동차의 고속도로 연비 평균을 알아보려고 함. 이 회사들의 데이터를 추출한 후 hwy 전체 평균을 분석
mpg_cfh <- mpg %>% filter(manufacturer %in% c("chevrolet", "ford", "honda"))

mean(mpg_cfh$hwy)

[1] 22.50943

# 필요한 변수만 추출하기

In [4]:
# exam 데이터에서 math 추출
exam %>% select(math)

   math
1  50
2  60
3  45
4  30
5  25
6  50
7  80
8  90
9  20
10 50
11 65
12 45
13 46
14 48
15 75
16 58
17 65
18 80
19 89
20 78

## 여러 변수 추출

In [5]:
# class, math, english 변수 추출
exam %>% select(class, math, english)

   class math english
1  1     50   98
2  1     60   97
3  1     45   86
4  1     30   98
5  2     25   80
6  2     50   89
7  2     80   90
8  2     90   78
9  3     20   98
10 3     50   98
11 3     65   65
12 3     45   85
13 4     46   98
14 4     48   87
15 4     75   56
16 4     58   98
17 5     65   68
18 5     80   78
19 5     89   68
20 5     78   83

## 변수 제외하기

In [6]:
# math, english 제외
exam %>% select(-math, -english)

   id class science
1   1 1     50
2   2 1     60
3   3 1     78
4   4 1     58
5   5 2     65
6   6 2     98
7   7 2     45
8   8 2     25
9   9 3     15
10 10 3     45
11 11 3     65
12 12 3     32
13 13 4     65
14 14 4     12
15 15 4     78
16 16 4     65
17 17 5     98
18 18 5     90
19 19 5     87
20 20 5     58

# dplyr 함수 조합

In [8]:
# class가 1인 행에서 english 추출
exam %>% filter(class == 1) %>% select(english)

  english
1 98
2 97
3 86
4 98

In [11]:
# 가독성 있는 코드
exam %>%
  filter(class == 1) %>%
  select(english)

  english
1 98
2 97
3 86
4 98

In [13]:
# 일부만 출력
exam %>%
  select(id, math) %>%
  head()

  id math
1 1  50
2 2  60
3 3  45
4 4  30
5 5  25
6 6  50

### mpg 데이터 분석 연습

*분석계획* : <br>
1. mpg 데이터에서 class(자동차 종류), cty(도시연비) 변수만 추출해 새로운 데이터 생성
2. 자동차 종류에 따라 도시 연비가 다른지 알아보려고 함. class(자동차 종류)가 "suv"인 자동차와 "compact"인 자동차 중 어떤 자동차의 cty 평균이 더 높은지 분석

In [15]:
# 데이터 불러오기
mpg <- as.data.frame(ggplot2::mpg)

In [23]:
# class, cty 변수 추출
df <- mpg %>% select(class, cty)
head(df)

  class   cty
1 compact 18
2 compact 21
3 compact 20
4 compact 21
5 compact 16
6 compact 18

In [25]:
# class가 suv인 행 추출 후 평균 cty 분석
df_suv <- df %>% filter(class == "suv")
mean(df_suv$cty)

[1] 13.5

In [26]:
# class가 compact인 행 추출 후 평균 cty 분석
df_compact <- df %>% filter(class == "compact")
mean(df_compact$cty)

[1] 20.12766

# 정렬

In [29]:
# exam 데이터 math 오름차순 정렬
exam %>% arrange(math)

   id class math english science
1   9 3     20   98      15
2   5 2     25   80      65
3   4 1     30   98      58
4   3 1     45   86      78
5  12 3     45   85      32
6  13 4     46   98      65
7  14 4     48   87      12
8   1 1     50   98      50
9   6 2     50   89      98
10 10 3     50   98      45
11 16 4     58   98      65
12  2 1     60   97      60
13 11 3     65   65      65
14 17 5     65   68      98
15 15 4     75   56      78
16 20 5     78   83      58
17  7 2     80   90      45
18 18 5     80   78      90
19 19 5     89   68      87
20  8 2     90   78      25

In [30]:
# math 내림차순 정렬
exam %>% arrange(desc(math))

   id class math english science
1   8 2     90   78      25
2  19 5     89   68      87
3   7 2     80   90      45
4  18 5     80   78      90
5  20 5     78   83      58
6  15 4     75   56      78
7  11 3     65   65      65
8  17 5     65   68      98
9   2 1     60   97      60
10 16 4     58   98      65
11  1 1     50   98      50
12  6 2     50   89      98
13 10 3     50   98      45
14 14 4     48   87      12
15 13 4     46   98      65
16  3 1     45   86      78
17 12 3     45   85      32
18  4 1     30   98      58
19  5 2     25   80      65
20  9 3     20   98      15

In [31]:
# 정렬 기준 변수 여러 개 지정
# class 및 math 오름차순 정렬
exam %>% arrange(class, math) # class 순으로 정렬 후 math를 정렬

   id class math english science
1   4 1     30   98      58
2   3 1     45   86      78
3   1 1     50   98      50
4   2 1     60   97      60
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9   9 3     20   98      15
10 12 3     45   85      32
11 10 3     50   98      45
12 11 3     65   65      65
13 13 4     46   98      65
14 14 4     48   87      12
15 16 4     58   98      65
16 15 4     75   56      78
17 17 5     65   68      98
18 20 5     78   83      58
19 18 5     80   78      90
20 19 5     89   68      87

### mpg 데이터 분석 연습

*분석계획* : <br>
1. audi에서 생산한 자동차 중에서 어떤 자동차 모델의 hwy가 가장 높은지 알아보려고 함. "audi"에서 생산한 자동차 중 hwy top5를 출력

In [32]:
mpg <- as.data.frame(ggplot2::mpg)

In [38]:
mpg %>% 
  filter(manufacturer == "audi") %>% 
  arrange(desc(hwy)) %>% 
  head(5)

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 audi         a4         2.0   2008 4   manual(m6) f   20  31  p  compact
2 audi         a4         2.0   2008 4   auto(av)   f   21  30  p  compact
3 audi         a4         1.8   1999 4   auto(l5)   f   18  29  p  compact
4 audi         a4         1.8   1999 4   manual(m5) f   21  29  p  compact
5 audi         a4 quattro 2.0   2008 4   manual(m6) 4   20  28  p  compact

# 파생변수 추가

In [39]:
# mutate() : 기존 데이터에 파생변수 추가
# mutate(변수명 = 계산식)

# 총합 변수 추가
exam %>%
  mutate(total = math + english + science) %>%
  head

  id class math english science total
1 1  1     50   98      50      198
2 2  1     60   97      60      217
3 3  1     45   86      78      209
4 4  1     30   98      58      186
5 5  2     25   80      65      170
6 6  2     50   89      98      237

In [42]:
# 여러 파생변수 한 번에 추가하기
exam %>%
  mutate(total = math + english + science,
         mean = (math + english + science) / 3) %>%
  head()

  id class math english science total mean
1 1  1     50   98      50      198   66.00000
2 2  1     60   97      60      217   72.33333
3 3  1     45   86      78      209   69.66667
4 4  1     30   98      58      186   62.00000
5 5  2     25   80      65      170   56.66667
6 6  2     50   89      98      237   79.00000

In [41]:
# mutate()에 ifelse() 적용하기
exam %>%
  mutate(test = ifelse(science >= 60, "pass", "fail")) %>%
  head()

  id class math english science test
1 1  1     50   98      50      fail
2 2  1     60   97      60      pass
3 3  1     45   86      78      pass
4 4  1     30   98      58      fail
5 5  2     25   80      65      pass
6 6  2     50   89      98      pass

In [43]:
# 추가한 변수를 dplyr 코드에 바로 활용하기
exam %>%
  mutate(total = math + english + science) %>%
  arrange(total) %>%
  head()

  id class math english science total
1  9 3     20   98      15      133
2 14 4     48   87      12      147
3 12 3     45   85      32      162
4  5 2     25   80      65      170
5  4 1     30   98      58      186
6  8 2     90   78      25      193

## mpg 데이터 분석 연습

*분석계획* : <br>
1. mpg 데이터에서 cty와 hwy를 합한 "합산 연비 변수"를 추가
2. 앞서 만든 "합산 연비 변수"를 2로 나눠 "평균 연비 변수"를 추가
3. "평균 연비 변수"가 가장 높은 자동차 3종의 데이터를 출력

In [44]:
mpg <- as.data.frame(ggplot2::mpg)

In [45]:
mpg %>%
  mutate(total = cty + hwy,
         mean = total / 2) %>%
  arrange(desc(mean)) %>%
  head(3)

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 volkswagen   new beetle 1.9   1999 4   manual(m5) f   35  44  d  subcompact
2 volkswagen   jetta      1.9   1999 4   manual(m5) f   33  44  d  compact
3 volkswagen   new beetle 1.9   1999 4   auto(l4)   f   29  41  d  subcompact
  total mean
1 79    39.5
2 77    38.5
3 70    35.0

# 집단별로 요약하기

In [47]:
# exam 데이터에서 math 평균 산출
exam %>%
  summarise(mean_math = mean(math))

  mean_math
1 57.45

In [48]:
# 집단별로 요약하기
exam %>%
  group_by(class) %>% # class 별로 분리
  summarise(mean_math = mean(math))

  class mean_math
1 1     46.25
2 2     61.25
3 3     45.00
4 4     56.75
5 5     78.00

In [50]:
# 여러 요약 통계량 한 번에 산출하기
exam %>%
  group_by(class) %>% # class 별로 분리
  summarise(mean_math = mean(math), # math 평균
            sum_math = sum(math), # math 합계
            median_math = median(math), # math 중앙값
            n = n()) # 학생 수

  class mean_math sum_math median_math n
1 1     46.25     185      47.5        4
2 2     61.25     245      65.0        4
3 3     45.00     180      47.5        4
4 4     56.75     227      53.0        4
5 5     78.00     312      79.0        4

## summarise()와 함께 사용할 수 있는 함수
- mean() : 평균
- sd() : 표준편차
- sum() : 합계
- median() : 중앙값
- min() : 최솟값
- max() : 최댓값
- n() : 빈도수

In [51]:
# 각 집단별로 다시 집단 나누기
mpg %>%
  group_by(manufacturer, drv) %>% # 제조사 별로 분리 후, 구동 방식별로 분리
  summarise(mean_cty = mean(cty)) %>%
  head()

`summarise()` has grouped output by 'manufacturer'. You can override using the
`.groups` argument.

  manufacturer drv mean_cty
1 audi         4   16.81818
2 audi         f   18.85714
3 chevrolet    4   12.50000
4 chevrolet    f   18.80000
5 chevrolet    r   14.10000
6 dodge        4   12.00000

## mpg 데이터로 dplyr 조합 연습

*회사별로 "suv" 자동차의 도시 및 고속도로 통합 연비(합계) 평균을 구해 내림차순으로 정렬하고, 상위 5개 출력하기*

1. 회사별로 분리 : group_by()
2. suv 추출 : filter()
3. 통합 연비 변수 생성 : mutate()
4. 통합 연비 평균 산출 : summarise()
5. 내림차순 정렬 : arrange()
6. 상위 5개 출력 : head()

In [54]:
mpg %>%
  group_by(manufacturer) %>% # 회사별로 분리
  filter(class == "suv") %>% # suv 추출
  mutate(tot = cty + hwy) %>% # 통합 연비 변수 생성
  summarise(mean_tot = mean(tot)) %>% # 통합 연비 평균 산출
  arrange(desc(mean_tot)) %>% # 내림차순 정렬
  head(5) # 상위 5개 출력

  manufacturer mean_tot
1 subaru       43.83333
2 toyota       32.62500
3 nissan       31.75000
4 mercury      31.25000
5 jeep         31.12500

*분석계획* : <br>
1. 어떤 차종의 도시 연비가 높은지 비교하려고 함. class별 cty 평균을 구한 뒤 내림차순으로 정렬
2. 어떤 회사 자동차의 hwy가 가장 높은지 알아보려고 함. hwy 평균이 가장 높은 회사 세 곳을 출력
3. 어떤 회사에서 "compact" 차종을 가장 많이 생산하는지 알아보려고 함. 각 회사별 "compact" 차종 수를 내림차순으로 정렬

In [63]:
# 1. 어떤 차종의 도시 연비가 높은지 비교하려고 함. class별 cty 평균을 구한 뒤 내림차순으로 정렬
mpg %>%
  group_by(class) %>% # class별 분리
  summarise(mean_cty = mean(cty)) %>% # cty 평균 구하기
  arrange(desc(mean_cty)) %>% # 내림차순 정렬
  head()

  class      mean_cty
1 subcompact 20.37143
2 compact    20.12766
3 midsize    18.75610
4 minivan    15.81818
5 2seater    15.40000
6 suv        13.50000

In [59]:
# 2. 어떤 회사 자동차의 hwy가 가장 높은지 알아보려고 함. hwy 평균이 가장 높은 회사 세 곳을 출력
mpg %>%
  group_by(manufacturer) %>% # 회사별 분리 
  summarise(mean_hwy = mean(hwy)) %>% # hwy 평균 구하기
  arrange(desc(mean_hwy)) %>% # 내림차순 정렬
  head(3) # 상위 3개 출력

  manufacturer mean_hwy
1 honda        32.55556
2 volkswagen   29.22222
3 hyundai      26.85714

In [61]:
# 3. 어떤 회사에서 "compact" 차종을 가장 많이 생산하는지 알아보려고 함. 각 회사별 "compact" 차종 수를 내림차순으로 정렬
mpg %>%
  filter(class == "compact") %>% # compact 추출
  group_by(manufacturer) %>% # 회사별 분리
  summarise(count = n()) %>% # 빈도 구하기 
  arrange(desc(count)) %>% # 내림차순 정렬
  head()

  manufacturer cnt
1 audi         15
2 volkswagen   14
3 toyota       12
4 subaru        4
5 nissan        2

# 데이터 합치기

In [64]:
test1 <- data.frame(id = c(1, 2, 3, 4, 5), midterm = c(60, 80, 70, 90, 85))

test2 <- data.frame(id = c(1, 2, 3, 4, 5), final = c(70, 83, 65, 95, 80))

In [65]:
print(test1)

  id midterm
1  1      60
2  2      80
3  3      70
4  4      90
5  5      85

In [66]:
print(test2)

  id final
1  1    70
2  2    83
3  3    65
4  4    95
5  5    80

In [68]:
# id 기준으로 합쳐서 df_tota에 할당
df_total <- left_join(test1, test2, by = "id")
df_total

  id midterm final
1 1  60      70
2 2  80      83
3 3  70      65
4 4  90      95
5 5  85      80

In [70]:
# 다른 데이터 활용해서 변수 추가하기
df_name <- data.frame(class = c(1, 2, 3, 4, 5), teacher = c("kim", "lee", "park", "choi", "jung"))
df_name

  class teacher
1 1     kim
2 2     lee
3 3     park
4 4     choi
5 5     jung

In [71]:
# class 기준으로 합치기
exam_new <- left_join(exam, df_name, by = "class")
exam_new

   id class math english science teacher
1   1 1     50   98      50      kim
2   2 1     60   97      60      kim
3   3 1     45   86      78      kim
4   4 1     30   98      58      kim
5   5 2     25   80      65      lee
6   6 2     50   89      98      lee
7   7 2     80   90      45      lee
8   8 2     90   78      25      lee
9   9 3     20   98      15      park
10 10 3     50   98      45      park
11 11 3     65   65      65      park
12 12 3     45   85      32      park
13 13 4     46   98      65      choi
14 14 4     48   87      12      choi
15 15 4     75   56      78      choi
16 16 4     58   98      65      choi
17 17 5     65   68      98      jung
18 18 5     80   78      90      jung
19 19 5     89   68      87      jung
20 20 5     78   83      58      jung

In [77]:
# 세로로 합치기
group_a <- data.frame(id = c(1:5), test = c(60, 80, 70, 90, 85))
group_b <- data.frame(id = c(6:10), test = c(70, 83, 65, 95, 80))

In [73]:
group_a

  id test
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

In [78]:
# 데이터를 세로로 합쳐서 group_all에 할당
group_all <- bind_rows(group_a, group_b)
group_all

   id test
1   1 60
2   2 80
3   3 70
4   4 90
5   5 85
6   6 70
7   7 83
8   8 65
9   9 95
10 10 80

## mpg 데이터 분석 연습

*분석계획* : <br>
1. fuel 데이터를 이용해서 mpg 데이터에 price_fl(연료가격) 변수를 추가
2. model, fl, price_fl 변수를 추출해 앞부분 5개행을 출력

In [87]:
# mpg 데이터
mpg <- as.data.frame(ggplot2::mpg)

In [82]:
# fuel 데이터
fuel <- data.frame(fl = c("c" , "d", "e", "p", "r"),
                   price_fl = c(2.35, 2.38, 2.11, 2.76, 2.22),
                   stringAsFactors = F) # 문자를 factor 타입으로 변환하지 않음

fuel

  fl price_fl stringAsFactors
1 c  2.35     FALSE
2 d  2.38     FALSE
3 e  2.11     FALSE
4 p  2.76     FALSE
5 r  2.22     FALSE

In [88]:
left_join(mpg, fuel, by = "fl") %>%
  select(model, fl, price_fl) %>%
  head(5)

  model fl price_fl
1 a4    p  2.76
2 a4    p  2.76
3 a4    p  2.76
4 a4    p  2.76
5 a4    p  2.76